{
  "1-1": {
    "event": "New Year - God's Covenant Renewal",
    "reference": "Lamentations 3:22-23",
    "text": "It is of the LORD'S mercies that we are not consumed, because his compassions fail not. They are new every morning: great is thy faithfulness.",
    "description": "God's mercies are renewed each morning, making New Year a time of fresh beginnings."
  },
  "1-6": {
    "event": "Epiphany - Manifestation of Christ",
    "reference": "Matthew 2:11",
    "text": "And when they were come into the house, they saw the young child with Mary his mother, and fell down, and worshipped him: and when they had opened their treasures, they presented unto him gifts; gold, and frankincense and myrrh.",
    "description": "The Wise Men worship Jesus, revealing Christ to the Gentiles."
  },
  "2-14": {
    "event": "Valentine's Day - God's Love",
    "reference": "1 John 4:8",
    "text": "He that loveth not knoweth not God; for God is love.",
    "description": "True love comes from God, who is love itself."
  },
  "3-17": {
    "event": "St. Patrick's Day - Missionary Spirit",
    "reference": "Matthew 28:19",
    "text": "Go ye therefore, and teach all nations, baptizing them in the name of the Father, and of the Son, and of the Holy Ghost:",
    "description": "St. Patrick brought the Gospel to Ireland, fulfilling the Great Commission."
  },
  "3-21": {
    "event": "Spring Equinox - New Life",
    "reference": "2 Corinthians 5:17",
    "text": "Therefore if any man be in Christ, he is a new creature: old things are passed away; behold, all things are become new.",
    "description": "Spring represents new life and spiritual rebirth in Christ."
  },
  "4-1": {
    "event": "April Fools - Wisdom vs Folly",
    "reference": "Proverbs 1:7",
    "text": "The fear of the LORD is the beginning of knowledge: but fools despise wisdom and instruction.",
    "description": "True wisdom begins with reverence for God, not worldly foolishness."
  },
  "4-14": {
    "event": "Passover Season",
    "reference": "1 Corinthians 5:7",
    "text": "Purge out therefore the old leaven, that ye may be a new lump, as ye are unleavened. For even Christ our passover is sacrificed for us:",
    "description": "Christ is our Passover Lamb, delivering us from sin's bondage."
  },
  "4-22": {
    "event": "Earth Day - Creation Care",
    "reference": "Genesis 1:31",
    "text": "And God saw every thing that he had made, and, behold, it was very good. And the evening and the morning were the sixth day.",
    "description": "God created the earth and called it good; we are stewards of His creation."
  },
  "5-1": {
    "event": "May Day - Labor and Rest",
    "reference": "Ecclesiastes 3:13",
    "text": "And also that every man should eat and drink, and enjoy the good of all his labour, it is the gift of God.",
    "description": "Work is a gift from God, and we should find joy in honest labor."
  },
  "5-8": {
    "event": "Mother's Day Weekend",
    "reference": "Proverbs 31:28",
    "text": "Her children arise up, and call her blessed; her husband also, and he praiseth her.",
    "description": "Honoring the godly mothers who shape our lives with love and wisdom."
  },
  "6-19": {
    "event": "Father's Day Weekend",
    "reference": "Ephesians 6:4",
    "text": "And, ye fathers, provoke not your children to wrath: but bring them up in the nurture and admonition of the Lord.",
    "description": "Fathers are called to lead their families with love and godly instruction."
  },
  "6-21": {
    "event": "Summer Solstice - God's Light",
    "reference": "Psalm 84:11",
    "text": "For the LORD God is a sun and shield: the LORD will give grace and glory: no good thing will he withhold from them that walk uprightly.",
    "description": "The longest day celebrates God as our light and source of life."
  },
  "7-4": {
    "event": "Independence Day - Freedom in Christ",
    "reference": "Galatians 5:1",
    "text": "Stand fast therefore in the liberty wherewith Christ hath made us free, and be not entangled again with the yoke of bondage.",
    "description": "True freedom comes through Christ's sacrifice and God's grace."
  },
  "8-15": {
    "event": "Mid-August - Harvest Preparation",
    "reference": "Galatians 6:9",
    "text": "And let us not be weary in well doing: for in due season we shall reap, if we faint not.",
    "description": "As farmers prepare for harvest, we persist in good works for God's kingdom."
  },
  "9-22": {
    "event": "Autumn Equinox - Harvest Time",
    "reference": "Matthew 9:37",
    "text": "Then saith he unto his disciples, The harvest truly is plenteous, but the labourers are few;",
    "description": "Autumn harvest reminds us of the spiritual harvest of souls."
  },
  "10-31": {
    "event": "Reformation Day - Scripture Alone",
    "reference": "2 Timothy 3:16",
    "text": "All scripture is given by inspiration of God, and is profitable for doctrine, for reproof, for correction, for instruction in righteousness:",
    "description": "Remembering the Protestant Reformation and the authority of Scripture."
  },
  "11-25": {
    "event": "Thanksgiving Week",
    "reference": "1 Thessalonians 5:18",
    "text": "In every thing give thanks: for this is the will of God in Christ Jesus concerning you.",
    "description": "Giving thanks to God for His abundant blessings and provision."
  },
  "12-21": {
    "event": "Winter Solstice - Light in Darkness",
    "reference": "John 8:12",
    "text": "Then spake Jesus again unto them, saying, I am the light of the world: he that followeth me shall not walk in darkness, but shall have the light of life.",
    "description": "On the darkest day, we remember Christ as the light that overcomes all darkness."
  },
  "12-24": {
    "event": "Christmas Eve - Awaiting Christ",
    "reference": "Luke 2:8-9",
    "text": "And there were in the same country shepherds abiding in the field, keeping watch over their flock by night. And, lo, the angel of the Lord came upon them, and the glory of the Lord shone round about them:",
    "description": "The night before Christ's birth, when angels announced the good news."
  },
  "12-25": {
    "event": "Christmas Day - Birth of Christ",
    "reference": "Luke 2:11",
    "text": "For unto you is born this day in the city of David a Saviour, which is Christ the Lord.",
    "description": "Celebrating the birth of Jesus Christ, our Savior and Lord."
  },
  "12-31": {
    "event": "New Year's Eve - God's Faithfulness",
    "reference": "Psalm 90:12",
    "text": "So teach us to number our days, that we may apply our hearts unto wisdom.",
    "description": "Reflecting on God's faithfulness through the year and seeking wisdom for the future."
  }
}